/* Exercises page */
"%@ points from %@" = "%1$@ Punkte von %2$@";

/* Got star for test level completion */
"%02i.%02i %@ (Got star)" = "%1$i.%2$i %3$@ (Man hat ein Sternchen bekommen)";

/* Solved level/path */
"%02i.%02i %@ (Solved)" = "%1$i.%2$i %3$@ (Gelöst)";

/* Solving page */
"Add answer" = "Antwort hinzufügen ";

/* Add action to Solving page */
"Add operation?" = "Operation  hinzufügen?";

/* No comment provided by engineer. */
"and" = "und";

/* No comment provided by engineer. */
"Answer" = "Antwort";

/* Solving page */
"Answer field is empty" = "Antwortsfeld ist leer";

/* Solving page */
"Answers are not identical to each other." = "Antworten stimmen nicht überein.";

/* Logout alert message */
"Are you sure you want to exit your profile? All your data will be save and you can come back any time." = "Sind Sie sicher, dass Sie sich ausloggen wollen? Ihre Daten sind gespeichert, und Sie können jederzeit zurückkehren";

/* No comment provided by engineer. */
"Calculation error" = "Rechenfehler";

/* Logout alert cancel button */
"Cancel" = "Abmeldung";

/* Solving page */
"Change answer" = "Antwort ändern";

/* Home screen on tap Olympiad */
"Child not selected." = "Kind ist nicht gewählt.";

/* No comment provided by engineer. */
"Coming soon" = "Bald";

/* Statistics */
"Day" = "Tag";

/* Delete subaction label at Solving page */
"Delete" = "Löschen";

/* Remove action from Solving page */
"Delete operation?" = "Operation löschen?";

/* Choose child popup */
"Enter child name" = "Name des Kindes";

/* Mail registration  popup */
"Enter your account" = "Loggen Sie sich ein";

/* Settings */
"Enter your facebook account to continue" = "Geben Sie Facebook-Account für Fortsetzung ein";

/* Settings */
"Enter your mail account to continue" = "Geben Sie Ihre e-mail-Adresse für Fortsetzung ein";

/* Mail registration  popup */
"Enter your password" = "Geben Sie Ihr Kennwort ein";

/* Profile achievements event status */
"Error" = "Fehler";

/* No comment provided by engineer. */
"Expression" = "Ausdruck";

/* No comment provided by engineer. */
"expression" = "mit dem Ausdruck";

/* Exercises page */
"find one more way to solve this problem and earn %d points more" = "Finden Sie noch einige Lösungsvariante der Aufgabe und bekommen noch  %d Punkte mehr";

/* Alert title */
"Message" = "Nahricht";

/* Statistics */
"Month" = "Monat";

/* No comment provided by engineer. */
"Name" = "Name";

/* No comment provided by engineer. */
"NO" = "NEIN";

/* Logout alert accept button */
"OK" = "OK";

/* Warning on attempt to solve test tasks with 2 tasks failed already */
"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type" = "Oops! Du hast mehr als 2 Fehler gemacht. Du darfst nicht die Textaufgaben weiter lösen, bis du die gleichen Aufgaben nicht löst.";

/* S&E level page label */
"Problem" = "Aufgabe";

/* S&E level page label */
"problem" = "Aufgabe";

/* Solving page */
"Save & Exit" = "Speichern";

/* No comment provided by engineer. */
"Solution" = "Lösung";

/* No comment provided by engineer. */
"solution" = "mit der Lösung";

/* Solved level/path */
"Solved" = "Gelöst";

/* Profile achievements event status */
"Solved task" = "Die Aufgabe ist gelöst";

/* Profile achievements event status */
"Started task" = "Fangen wir an";

/* Popup error description */
"Structure and calculation error" = "Verständnis- und Rechenfehler";

/* Popup error description */
"Structure error" = "Verständnisfehler";

/* No comment provided by engineer. */
"Task" = "Aufgabe";

/* Solving page */
"Task can have just one correct answer! Input the same ANSWER to all fields" = "Diese Aufgabe kann nur eine richtige Antwort haben! Setze gleiche Antworten in alle Felder ein";

/* No comment provided by engineer. */
"Task is not solved with all possible variants." = "Nicht alle möglichen Lösungsvarianten der Aufgabe gefunden";

/* No comment provided by engineer. */
"Task is solved with all possible solutions and expressions" = "Alle möglichen Lösungsvarianten der Aufgabe gefunden ";

/* Olympiad solving page */
"There are empty gaps. You should fill every gap" = "Nicht alle Lücken sind ausgefüllt. Du musst jede Lücke ausfüllen";

/* S&E level page label */
"Training" = "Training";

/* Statistics */
"Understanding error" = "Verständnisfehler";

/* Statistics */
"Week" = "Woche";

/* No comment provided by engineer. */
"YES" = "JA";

/* Solving page */
"You can add just expression for this task!" = "Diese Aufgabe kann nur mit Hilfe von der Formel gelöst sein!";

/* action remove error */
"You can't delete error." = "Du kannst die Lösung, wo ein Fehler gibt, nicht löschen";

/* Solving page */
"You have added all possible expressions" = "Du hast alle Lösungsvarianten mit Hilfe von den Formeln gefunden";

/* Solving page */
"You have added all possible solutions" = "Du hast alle Lösungsvariante mit Hilfe von den Operationen gefunden";

/* Exercises page */
"you have solved this problem with all possible solution and expression" = "Du hast alle möglichen Lösungsvarianten gefunden";

/* Mail registration  popup */
"You should input all rows" = "Du must alle Felder ausfüllen";

/* Back-end errors
 
 /* No comment provided by engineer. */
"Unable to perform action" = "Operation ist unmöglich";

/* No comment provided by engineer. */
"Email and Password fields are required" = "E-mail und Kennwort sind Pflichtfelder";

/* No comment provided by engineer. */
"Incorrect email format" = "Falsches e-mail-Format";

/* No comment provided by engineer. */
"User with same email already exists" = "Nutzer mit dieser e-mail-Adresse exestiert schon";

/* No comment provided by engineer. */
"Incorrect password" = "Falsches Kennwort";

/* No comment provided by engineer. */
"User not found" = "Nutzer ist nicht gefunden";

/* No comment provided by engineer. */
"User not found, you need to specify email to register" = "Nutzer ist nicht gefunden. Sie müssen Ihre e-mail-Adresse bestätigen, um sich zu regestrieren";

/* No comment provided by engineer. */
"Name field is required" = "Füllen Sie Feld Name aus";

/* No comment provided by engineer. */
"Child with this name already exists" = "Kind mit solchem Namen exestiert schon";

/* No comment provided by engineer. */
"Child not found" = "Kind ist nicht gefunden";

/* No comment provided by engineer. */
"You need to set active child" = "Wählen Sie ein Kind";

/* No comment provided by engineer. */
"Permissions Denied" = "Zugriff wurde verweigert";

/* No comment provided by engineer. */
"Authorization Error" = " Identifizierungsfehler ";

/* No comment provided by engineer. */
"Synchronizing. Tap to cancel" = "Synchronisation. Drücken Sie, um abzumelden";

/* No comment provided by engineer. */
"Synchronizing" = "Synchronisation";

/* No comment provided by engineer. */
"Sending data" = "Datenabsendung";

/* No comment provided by engineer. */
"Getting data" = "Datengewinnung";

/* No comment provided by engineer. */
"Pull to refresh" = "Ziehen Sie, um fortzusetzen";

/* No comment provided by engineer. */
"Done" = "Fertig";

"Passwords don't match" = "Kennwörter stimmen nicht überein";

"Password is changed" = "Das Kennwort ist verändert";

"Password was sent to your e-mail" = "Das Kennwort war Ihnen per E-Mail geschickt";

/* post to FB */

"I solved test problem #%@ from the topic \"%@\"!" = "Ich habe die Testaufgabe №%@ im Thema \"%@\" gelöst!";

"I solved all the test problems from the topic \"%@\"!" = "Ich habe die Testaufgaben im Thema \"%@\" gelöst!";

"I solved olympiad problem #%@ of the first level of the \"%@\"!" = "Ich habe die Aufgabe der Olympiade №%@ в \"%@\" gelöst!";

"I solved the first level of the \"%@\"!" = "Ich habe die erste Olympiade \"%@\" gelöst!";

/* paret hlep */

"- %@ level of difficulty" = "- %@ Niveaus der Kompliziertheit";

"- Solve %@ problems" = "- %@ Aufgaben, um zu lösen";

"- %@ test problems" = "- %@ Testaufgaben";

"%i. Witty olympiad problems %i levels with %@ problems in each" = "%i. Denkaufgaben der Olympiade (%i Niveaus, je %@ Aufgaben)";

"A total of %@ problems, %@ test problems, %@ olympiad problems" = "Es gibt %@ Aufgaben, %@ Testaufgaben, %@ Aufgaben der Olympiade insgesammt";

/* animation alert*/

"You need an internet connection in order to watch the animation" = "Um die Animation durchschauen, brauchen Sie die Internetanschaltung";

"Server Error" = "Server ist zeitweilig unzugänglich. Wir bringen Ihnen unsere Entschuldigung. Wir verbessern die Arbeit des Servers. Sie können Ihre Arbeit off-line fortsetzen oder später ins App zurückkehren.";

/*confirm alert */

"You need to confirm your e-mail before continue" = "Necesita confirmar su e-mail antes de continuar";

"Remove child %@ confirmation" = "Sie wollen %@ aus dem App LocaMath löschen? Die ganze Statistik wird verloren sein!";
"Remove child %@ confirmation email" = "Wir haben Ihnen die E-Mail geschickt, um die Löschung zu bestätigen! Bestätigen Sie die Löschung %@ per E-Mail.";

"Confirm_ERROR" = "Kennwörter stimmen nicht überein";

//Not translated
"Failed to get location, check your network connection" = "If location cannot be selected now please check Internet connection and update later on Settings Page";
"Dismiss" = "Dismiss";
"Invalid nickname. You can use only Latin/Cyrillic symbols, whitespaces, digits and symbols '.-_'. Maximum is 15 symbols" =
"The name can consist of alphanumeric A-Z, 0-9; whitespace; special characters '.-_' with maximum length of 15 characters.";
"Invalid email" = "Invalid email";
"Invalid password. Input from 6 to 15 symbols" = "Invalid password. Input from 6 to 15 characters";

//Warning on attempt to solve test tasks with 2 tasks failed already
"Oops! You made more than two mistakes. You can't continue solving the test problems until you finish solving the previous problems of this type"= "Sorry, you must not have more than two mistakes to proceed. Please go back to previous sublevels and complete all problems";

"Censored nickname error" = "This name is not allowed. Please check and submit another name.";

//default popup
"Explain default label" = "To register, click «ok» to continue using the application, press «continue»";

"Explain default label0" = "Without registration:\n\n The child can not participate in the ranking and compete with other kids!\n\n Only one child will be able to use the app!\n\n You will not be able to get reports and statistics on the progress of your child!";

"Explain default label1" = "This section is for our teammates!\n\n Do you want to be in our team - ask your parents to register!";

"Explain default label2" = "Dear Parents,\n\n This is the page of reports and statistics.\n\n We need you to be registered to provide you information about your kid progress!";

"Set name for default child" = "Enter child name";

"Explain default label4" = "To register, click «ok» to continue using the application, press «cancel»!";

"Continue" = "Weiter";

"Mistake put scheme message" = "You should find right item and drag it to build diagram";

"Points earned" = "Du hast";

"https://www.facebook.com/Locamath" = "https://www.facebook.com/Locamath";

"fb_Locamath" = "fb://profile/279755092127204";

"The Internet connection appears to be offline." = "Es besteht anscheinend keine Verbindung zum Internet";

"No internet connection, вы не можете зарегистрироваться через FB при отсутствии интернета, зарегистрируйтесь при помощи почты" =
"With no internet connection you can register only with email";

"Edit" = "Edit";

"Save & Exit" = "Speichern";

"Check facebook permissions and try again later" = "Check facebook permissions and try again later";

"The version is application is lower than required/ Please update your application/" = "You should update application to make it works properly! ";

"Please enter your name" = "Geben Sie Ihren Namen";

"Register" = "Registrieren";

"Login" = "Einloggen";

//tutorial
"tap to see animation!" = "Tap here to see the animation!";

"tap to build diagram here!" = "Tap here to build diagram!";

"drag the items here to make diagram!" = "Drag the items here to make diagram!";

"tap to solve the problem!" = "Tap here to solve problem!";

"drag & drop the numbers here to solve the problem!" = "Drag the numbers here to solve the problem!";

"tap to see the mistake!" = "Tap here to see mistake";


//new solving

"Solution1" = "Lösung";

"math expression" = "mit dem Ausdruck";

"math solution" = "nach den Operationen";

"scheme_success_message" = "Great! Diagram is done!";

"The same solutions, change one of them!" = "You entered the same solutions, edit or delete one of them!";
